tests/Tax/stubs/Avalara/testCommitSuccess.json

{
  "id": 361893958,
  "code": "d3a56b98-9812-4334-a257-eac9d9ff6b0d",
  "companyId": 799582,
  "date": "2017-10-12",
  "paymentDate": "1900-01-01",
  "status": "Committed",
  "type": "SalesInvoice",
  "batchCode": "",
  "currencyCode": "USD",
  "customerUsageType": "",
  "customerVendorCode": "0",
  "exemptNo": "",
  "reconciled": false,
  "purchaseOrderNo": "",
  "referenceCode": "",
  "salespersonCode": "",
  "taxOverrideType": "None",
  "taxOverrideAmount": 0.0000,
  "taxOverrideReason": "",
  "totalAmount": 10.0000,
  "totalExempt": 0.0000,
  "totalTax": 0.6000,
  "totalTaxable": 10.0000,
  "totalTaxCalculated": 0.6000,
  "adjustmentReason": "NotAdjusted",
  "adjustmentDescription": "",
  "locked": false,
  "region": "KY",
  "country": "US",
  "version": 1,
  "softwareVersion": "17.10.1.2",
  "originAddressId": 898193992,
  "destinationAddressId": 898193992,
  "exchangeRateEffectiveDate": "2017-10-12",
  "exchangeRate": 1.0000,
  "isSellerImporterOfRecord": false,
  "businessIdentificationNo": "",
  "modifiedDate": "2017-10-12T15:12:02.15",
  "modifiedUserId": 301742,
  "taxDate": "2017-10-12T00:00:00",
  "lines": [
    {
      "id": 1282976407,
      "transactionId": 361893958,
      "lineNumber": "1",
      "boundaryOverrideId": 0,
      "customerUsageType": "",
      "description": "",
      "destinationAddressId": 898193992,
      "originAddressId": 898193992,
      "discountAmount": 0.0000,
      "exemptAmount": 0.0000,
      "exemptCertId": 0,
      "exemptNo": "",
      "isItemTaxable": true,
      "isSSTP": true,
      "itemCode": "62390644",
      "lineAmount": 10.0000,
      "quantity": 1.0000,
      "ref1": "",
      "ref2": "",
      "reportingDate": "2017-10-12",
      "revAccount": "",
      "sourcing": "Destination",
      "tax": 0.6000,
      "taxableAmount": 10.0000,
      "taxCalculated": 0.6000,
      "taxCode": "P0000000",
      "taxCodeId": 8087,
      "taxDate": "2017-10-12",
      "taxEngine": "",
      "taxOverrideType": "None",
      "businessIdentificationNo": "",
      "taxOverrideAmount": 0.0000,
      "taxOverrideReason": "",
      "taxIncluded": false,
      "details": [
        {
          "id": 2366224105,
          "transactionLineId": 1282976407,
          "transactionId": 361893958,
          "addressId": 898193992,
          "country": "US",
          "region": "KY",
          "stateFIPS": "21",
          "exemptAmount": 0.0000,
          "exemptReasonId": 4,
          "inState": true,
          "jurisCode": "21",
          "jurisName": "KENTUCKY",
          "jurisdictionId": 21,
          "signatureCode": "AVNA",
          "stateAssignedNo": "",
          "jurisType": "STA",
          "nonTaxableAmount": 0.0000,
          "nonTaxableRuleId": 0,
          "nonTaxableType": "RateRule",
          "rate": 0.060000,
          "rateRuleId": 1228047,
          "rateSourceId": 3,
          "serCode": " ",
          "sourcing": "Destination",
          "tax": 0.6000,
          "taxableAmount": 10.0000,
          "taxType": "Sales",
          "taxName": "KY STATE TAX",
          "taxAuthorityTypeId": 45,
          "taxRegionId": 2118368,
          "taxCalculated": 0.6000,
          "taxOverride": 0.0000,
          "rateType": "General",
          "rateTypeCode": "G",
          "taxableUnits": 10.0000,
          "nonTaxableUnits": 0.0000,
          "exemptUnits": 0.0000,
          "unitOfBasis": "PerCurrencyUnit"
        }
      ],
      "lineLocationTypes": [
        {
          "documentLineLocationTypeId": 1109043497,
          "documentLineId": 1282976407,
          "documentAddressId": 898193992,
          "locationTypeCode": "PointOfOrderOrigin"
        },
        {
          "documentLineLocationTypeId": 1109043496,
          "documentLineId": 1282976407,
          "documentAddressId": 898193992,
          "locationTypeCode": "PointOfOrderAcceptance"
        },
        {
          "documentLineLocationTypeId": 1109043495,
          "documentLineId": 1282976407,
          "documentAddressId": 898193992,
          "locationTypeCode": "ShipTo"
        },
        {
          "documentLineLocationTypeId": 1109043494,
          "documentLineId": 1282976407,
          "documentAddressId": 898193992,
          "locationTypeCode": "ShipFrom"
        }
      ],
      "parameters": {}
    }
  ],
  "addresses": [
    {
      "id": 898193992,
      "transactionId": 361893958,
      "boundaryLevel": "Zip5",
      "line1": "737 Imogene Burg Suite 289",
      "line2": "Apt. 201",
      "line3": "",
      "city": "Louisville",
      "region": "KY",
      "postalCode": "40203",
      "country": "US",
      "taxRegionId": 2118368,
      "latitude": "38.244736",
      "longitude": "-85.76326"
    }
  ],
  "locationTypes": [
    {
      "documentLocationTypeId": 74002581,
      "documentId": 361893958,
      "documentAddressId": 898193992,
      "locationTypeCode": "ShipTo"
    }
  ],
  "summary": [
    {
      "country": "US",
      "region": "KY",
      "jurisType": "State",
      "jurisCode": "21",
      "jurisName": "KENTUCKY",
      "taxAuthorityType": 45,
      "stateAssignedNo": "",
      "taxType": "Sales",
      "taxName": "KY STATE TAX",
      "rateType": "General",
      "taxable": 10.00,
      "rate": 0.060000,
      "tax": 0.60,
      "taxCalculated": 0.60,
      "nonTaxable": 0.00,
      "exemption": 0.00
    }
  ],
  "parameters": {}
}